print("გავიცანი და დავუმეგობრდი") 

#nika keselava
#vano motiashvili

print("რას ვფიქრობ GOAზე")

#მეგობრული გარემო
#საუკეთესო მასწავლებელი
#საუკეთესო მენტორი
#ადგილი ისეთი სადაც შეიძენ საუკეთსო ცოდნას გამოცდილებას და მეგობრებს 
#მიზნების მიღწევაში დამხმარე აკადემია


print("სამომავლო მიზნები GOAში")

#გავხდე წარმატებული პროგრამისტი
#მაქსიმალურად გამოვიყენო დრო რომ ეს სფერო კარგად შევისწავლო
#გავიტანო ამ საუკეთესო აკადემიის სახელი ჩემს ახლო ადამიანებში და მეგობრებში
#გამოვიყენო ის ცოდნა რასაც მენტორი და მასწავლებელი მომცემს 