#1) შექმენით ფუნქცია, რომელშიც გააერთიანებთ იმ ფუნქციებს რაც დღეს ვისწავლეთ (lower(), upper(), capitalize(), find())

#2) შექმენით ფუნქცია რომელსაც გადაეცემა list = ["name1" , "name2" , "name3"....]
#შემდეგ მომხმარებელს კითხეთ რომელი ინდექსის შეცვლა სურს და ამის მიხედვით შეცვალეთ 
# ის კონკრეტული ინდექსი თქვენი სასურველი სტრინგით და ბოლოს შეაერთეთ join() ფუნქციის მეშვეობით 

#join - აერთებს ლისტში მდებარე ელემენტებს
#spilt - აცალკევებს სტრინგში მდებარე ელემენტებს 

# def myfunction(list = ["robot", "car", "shoes", "pc", "bag"]): 
#     result = " ".join(list) 
#     return myfunction

# print(myfunction(["robot", "car", "shoes", "pc", "bag"])) 

#3) დეტალურად, კომენტარის სახით ახსენით split() და join() ფუნქციები, შეეცადეთ ახსნათ chad-ურად, წარმოიდგინეთ რომ მეგობარს უხსნით ვინც პროგრამირებაზე არაფერი იცის

#split - ეს არის ფუნქცია რომელიც აცალკევებს სტრინგში მდებარე ელემენტებს 
#join() - ეს არის ფუნქცია, რომელიც სტრინში ჩასმულ ელემენტებს აკავშირებს ერთმანეთთან მაგალითად სიტყვებს, რომელისგანაც ჩვენ შეგვიძლია შევადგინოთ წინადადება და ა.შ