#1) შექმენით სია პროგრამირების ენების შესახებ, შეიტანეთ 5 პროგრამირების ენა. დაპრინტეთ  ჯერ მთლიანი სია, შემდეგ კი ბოლო ელემენტი.

proggraming_list = ["python, javascript, html, c++, php"] 

print('programming_list')  

print('programing_list'[4]) 


#2) შექმენით სია, სადაც გექნებათ შეტანილი string, integer, float, boolean. საბოლოოდ ყველა ელემენტი ცალ-ცალკე გამოიტანეთ.

number_list = ["5", "5.2", "5"] 

print(number_list)

print(number_list[0])

print(number_list[1]) 

print(number_list[2])


#3) შექმენით სია, სადაც გექნებათ 0-იდან 20-ის ჩათვლით 4-ის ჯერადები და პრინტით გამოიტანეთ უდიდესი.

math_list = ["4", "8", "12", "16", "20"]

print(math_list) 

print(math_list[4]) 


#4) შექმენით სია სადაც შეტანილი გექნებათ 30-იდან 50-ის ჩათვლით კენტი რიცხვები. შემდეგ დაპტინტეთ სამი უმცირესი ელემენტის ჯამი.

my_list = ["31", "33", "35", "37", "39", "41", "43", "45", "47", "49"]

print(number_list) 

#5) დაპრინტეთ სამის ჯერადები დავალება 4-ის სიიდან.

my_list = ["31", "33", "35", "37", "39", "41", "43", "45", "47", "49"]

print(my_list) 

print(my_list[33, 36, 39,]) 